2016/brp 2016-02-09/art/art-data/resources/resources/RequestTemplates/KUC131-Kiesrecht_request_template-131.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>${DataSource Values#Header_EEE1}</soapenv:Header>
   <soapenv:Body>
      <brp:bhg_vkzRegistreerKiesrecht xmlns:brp="http://www.bzk.nl/brp/brp0200">
         <brp:stuurgegevens brp:communicatieID="comid.stuurgegevens00B">
            <brp:zendendePartij>${DataSource Values#zendendePartij_zsV1}</brp:zendendePartij>
            <brp:zendendeSysteem>${DataSource Values#zendendeSysteem_zsV1}</brp:zendendeSysteem>
            <brp:referentienummer>${DataSource Values#referentienummer_sVB1}</brp:referentienummer>
            <brp:tijdstipVerzending>[moment_volgen]</brp:tijdstipVerzending>
         </brp:stuurgegevens>
         <brp:parameters brp:communicatieID="comid.parameters0">
            <brp:verwerkingswijze>${DataSource Values#verwerkingswijze_pVB1}</brp:verwerkingswijze>
         </brp:parameters>
         <brp:wijzigingUitsluitingKiesrecht
                                              brp:communicatieID="${DataSource Values#com_id.wijzigingUitsluitingKiesrecht1}"
                                              brp:objecttype="AdministratieveHandeling">
            <brp:partijCode>${DataSource Values#partijCode_rVB1}</brp:partijCode>
            <brp:toelichtingOntlening>${DataSource Values#toelichtingOntlening_rVB1}</brp:toelichtingOntlening>
            <brp:gedeblokkeerdeMeldingen>
               <brp:gedeblokkeerdeMelding brp:communicatieID="${DataSource Values#com_id.gedeblokkeerdeMelding1}"
                                          brp:referentieID="${DataSource Values#ref_id.gedeblokkeerdeMelding1}"
                                          brp:objecttype="GedeblokkeerdeMelding">
                  <brp:regelCode>${DataSource Values#regelCode_ggr1}</brp:regelCode>
                  <brp:elementNaam>${DataSource Values#elementNaam_ggr1}</brp:elementNaam>
               </brp:gedeblokkeerdeMelding>
            </brp:gedeblokkeerdeMeldingen>
            <brp:bronnen>
				<brp:bron brp:objecttype="ActieBron" brp:communicatieID="${DataSource Values#comid.bron1}">
				   <brp:document brp:communicatieID="Document1" brp:objecttype="Document">
					  <brp:soortNaam>${DataSource Values#soortNaam_dbr1}</brp:soortNaam>
					  <brp:identificatie>${DataSource Values#identificatie_dbr1}</brp:identificatie>
					  <brp:aktenummer>${DataSource Values#aktenummer_dbr1}</brp:aktenummer>
					  <brp:partijCode>${DataSource Values#partijCode_dbr1}</brp:partijCode>
				   </brp:document>
				</brp:bron>
            </brp:bronnen>
            <brp:acties>
               <brp:registratieUitsluitingKiesrecht brp:communicatieID="${DataSource Values#com_id.wijzigingUitsluitingKiesrecht2}"
                                                    brp:objecttype="Actie">
                  <brp:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_rar1}</brp:datumAanvangGeldigheid>
                  <brp:datumEindeGeldigheid>${DataSource Values#datumEindeGeldigheid_rar1}</brp:datumEindeGeldigheid>
                  <brp:bronnen>
					<brp:bron brp:communicatieID="BronDocument1"
                              brp:referentieID="${DataSource Values#refid.brondocument1}"
                              brp:objecttype="ActieBron">
					</brp:bron>
                  </brp:bronnen>
                  <brp:persoon brp:communicatieID="${DataSource Values#com_id.persoon1}"
                               brp:objecttype="Persoon"
                               brp:objectSleutel="${DataSource Values#objectid.persoon1}">
                     <brp:uitsluitingKiesrecht brp:communicatieID="${DataSource Values#com_id.uitsluitingKiesrecht1}">
                        <brp:indicatie>${DataSource Values#indicatie_upr1}</brp:indicatie>
                        <brp:datumVoorzienEinde>${DataSource Values#datumVoorzienEinde_upr1}</brp:datumVoorzienEinde>
                     </brp:uitsluitingKiesrecht>
                  </brp:persoon>
               </brp:registratieUitsluitingKiesrecht>
            </brp:acties>
         </brp:wijzigingUitsluitingKiesrecht>
         <brp:wijzigingDeelnameEUVerkiezingen
                                           brp:communicatieID="${DataSource Values#com_id.wijzigingDeelnameEUVerkiezingen1}"
                                           brp:objecttype="AdministratieveHandeling">
            <brp:partijCode>${DataSource Values#partijCode_rVB2}</brp:partijCode>
            <brp:toelichtingOntlening>${DataSource Values#toelichtingOntlening_rVB2}</brp:toelichtingOntlening>
            <brp:gedeblokkeerdeMeldingen>
               <brp:gedeblokkeerdeMelding brp:communicatieID="${DataSource Values#com_id.gedeblokkeerdeMelding2}"
                                          brp:referentieID="${DataSource Values#ref_id.gedeblokkeerdeMelding2}"
                                          brp:objecttype="GedeblokkeerdeMelding">
                  <brp:regelCode>${DataSource Values#regelCode_ggr2}</brp:regelCode>
                  <brp:elementNaam>${DataSource Values#elementNaam_ggr2}</brp:elementNaam>
               </brp:gedeblokkeerdeMelding>
            </brp:gedeblokkeerdeMeldingen>
            <brp:bronnen>
				<brp:bron brp:objecttype="ActieBron" brp:communicatieID="${DataSource Values#comid.bron2}">
				   <brp:document brp:communicatieID="Document2" brp:objecttype="Document">
					  <brp:soortNaam>${DataSource Values#soortNaam_dbr2}</brp:soortNaam>
					  <brp:identificatie>${DataSource Values#identificatie_dbr2}</brp:identificatie>
					  <brp:aktenummer>${DataSource Values#aktenummer_dbr2}</brp:aktenummer>
					  <brp:partijCode>${DataSource Values#partijCode_dbr2}</brp:partijCode>
				   </brp:document>
			   </brp:bron>
            </brp:bronnen>
            <brp:acties>
               <brp:registratieDeelnameEUVerkiezingen brp:communicatieID="${DataSource Values#comid.registratieDeelnameEUVerkiezingen1}"
                                              brp:objecttype="Actie">
                  <brp:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_rar2}</brp:datumAanvangGeldigheid>
                  <brp:datumEindeGeldigheid>${DataSource Values#datumEindeGeldigheid_rar2}</brp:datumEindeGeldigheid>
                  <brp:bronnen>
					<brp:bron brp:communicatieID="BronDocument2"
                              brp:referentieID="${DataSource Values#refid.brondocument2}"
                              brp:objecttype="ActieBron">
					</brp:bron>
                  </brp:bronnen>
                  <brp:persoon brp:communicatieID="${DataSource Values#com_id.persoon2}"
                               brp:objecttype="Persoon"
                               brp:objectSleutel="${DataSource Values#objectid.persoon2}">
                     <brp:deelnameEUVerkiezingen brp:communicatieID="${DataSource Values#com_id.deelnameEUVerkiezingen1}">
                        <brp:indicatieDeelname>${DataSource Values#indicatieDeelname_epr1}</brp:indicatieDeelname>
                        <brp:datumAanleidingAanpassing>${DataSource Values#datumAanleidingAanpassing_epr1}</brp:datumAanleidingAanpassing>
                        <brp:datumVoorzienEindeUitsluiting>${DataSource Values#datumVoorzienEindeUitsluiting_epr1}</brp:datumVoorzienEindeUitsluiting>
                     </brp:deelnameEUVerkiezingen>
                  </brp:persoon>
               </brp:registratieDeelnameEUVerkiezingen>
            </brp:acties>
         </brp:wijzigingDeelnameEUVerkiezingen>
      </brp:bhg_vkzRegistreerKiesrecht>
   </soapenv:Body>
</soapenv:Envelope>
